###################################################################

# Created by write_sdc on Tue Dec  5 21:53:21 2023

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_max_area 0
set_load -pin_load 2 [get_ports {sum[16]}]
set_load -pin_load 2 [get_ports {sum[15]}]
set_load -pin_load 2 [get_ports {sum[14]}]
set_load -pin_load 2 [get_ports {sum[13]}]
set_load -pin_load 2 [get_ports {sum[12]}]
set_load -pin_load 2 [get_ports {sum[11]}]
set_load -pin_load 2 [get_ports {sum[10]}]
set_load -pin_load 2 [get_ports {sum[9]}]
set_load -pin_load 2 [get_ports {sum[8]}]
set_load -pin_load 2 [get_ports {sum[7]}]
set_load -pin_load 2 [get_ports {sum[6]}]
set_load -pin_load 2 [get_ports {sum[5]}]
set_load -pin_load 2 [get_ports {sum[4]}]
set_load -pin_load 2 [get_ports {sum[3]}]
set_load -pin_load 2 [get_ports {sum[2]}]
set_load -pin_load 2 [get_ports {sum[1]}]
set_load -pin_load 2 [get_ports {sum[0]}]
set_input_transition -max 0.15  [get_ports {a[15]}]
set_input_transition -min 0.15  [get_ports {a[15]}]
set_input_transition -max 0.15  [get_ports {a[14]}]
set_input_transition -min 0.15  [get_ports {a[14]}]
set_input_transition -max 0.15  [get_ports {a[13]}]
set_input_transition -min 0.15  [get_ports {a[13]}]
set_input_transition -max 0.15  [get_ports {a[12]}]
set_input_transition -min 0.15  [get_ports {a[12]}]
set_input_transition -max 0.15  [get_ports {a[11]}]
set_input_transition -min 0.15  [get_ports {a[11]}]
set_input_transition -max 0.15  [get_ports {a[10]}]
set_input_transition -min 0.15  [get_ports {a[10]}]
set_input_transition -max 0.15  [get_ports {a[9]}]
set_input_transition -min 0.15  [get_ports {a[9]}]
set_input_transition -max 0.15  [get_ports {a[8]}]
set_input_transition -min 0.15  [get_ports {a[8]}]
set_input_transition -max 0.15  [get_ports {a[7]}]
set_input_transition -min 0.15  [get_ports {a[7]}]
set_input_transition -max 0.15  [get_ports {a[6]}]
set_input_transition -min 0.15  [get_ports {a[6]}]
set_input_transition -max 0.15  [get_ports {a[5]}]
set_input_transition -min 0.15  [get_ports {a[5]}]
set_input_transition -max 0.15  [get_ports {a[4]}]
set_input_transition -min 0.15  [get_ports {a[4]}]
set_input_transition -max 0.15  [get_ports {a[3]}]
set_input_transition -min 0.15  [get_ports {a[3]}]
set_input_transition -max 0.15  [get_ports {a[2]}]
set_input_transition -min 0.15  [get_ports {a[2]}]
set_input_transition -max 0.15  [get_ports {a[1]}]
set_input_transition -min 0.15  [get_ports {a[1]}]
set_input_transition -max 0.15  [get_ports {a[0]}]
set_input_transition -min 0.15  [get_ports {a[0]}]
set_input_transition -max 0.15  [get_ports {b[15]}]
set_input_transition -min 0.15  [get_ports {b[15]}]
set_input_transition -max 0.15  [get_ports {b[14]}]
set_input_transition -min 0.15  [get_ports {b[14]}]
set_input_transition -max 0.15  [get_ports {b[13]}]
set_input_transition -min 0.15  [get_ports {b[13]}]
set_input_transition -max 0.15  [get_ports {b[12]}]
set_input_transition -min 0.15  [get_ports {b[12]}]
set_input_transition -max 0.15  [get_ports {b[11]}]
set_input_transition -min 0.15  [get_ports {b[11]}]
set_input_transition -max 0.15  [get_ports {b[10]}]
set_input_transition -min 0.15  [get_ports {b[10]}]
set_input_transition -max 0.15  [get_ports {b[9]}]
set_input_transition -min 0.15  [get_ports {b[9]}]
set_input_transition -max 0.15  [get_ports {b[8]}]
set_input_transition -min 0.15  [get_ports {b[8]}]
set_input_transition -max 0.15  [get_ports {b[7]}]
set_input_transition -min 0.15  [get_ports {b[7]}]
set_input_transition -max 0.15  [get_ports {b[6]}]
set_input_transition -min 0.15  [get_ports {b[6]}]
set_input_transition -max 0.15  [get_ports {b[5]}]
set_input_transition -min 0.15  [get_ports {b[5]}]
set_input_transition -max 0.15  [get_ports {b[4]}]
set_input_transition -min 0.15  [get_ports {b[4]}]
set_input_transition -max 0.15  [get_ports {b[3]}]
set_input_transition -min 0.15  [get_ports {b[3]}]
set_input_transition -max 0.15  [get_ports {b[2]}]
set_input_transition -min 0.15  [get_ports {b[2]}]
set_input_transition -max 0.15  [get_ports {b[1]}]
set_input_transition -min 0.15  [get_ports {b[1]}]
set_input_transition -max 0.15  [get_ports {b[0]}]
set_input_transition -min 0.15  [get_ports {b[0]}]
